000100*API8.SOURCE.COBOL(ASSEQSTR)
000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. ASSEQSTR.
000400 
000500 DATA DIVISION.
000600 WORKING-STORAGE SECTION.
000700 
000800 LINKAGE SECTION.
000900 COPY TESTCONT.
001000 01 TEST-NAME PIC X(30).
001100 01 EXPECTED  PIC X(10).
001200 01 ACTUAL    PIC X(10).
001300
001400 PROCEDURE DIVISION USING TEST-CONTEXT
001500                          TEST-NAME
001600                          EXPECTED ACTUAL.
001700
001800     ADD 1 TO TESTS-RUN
001900    
002000     IF ACTUAL = EXPECTED THEN
002100         ADD 1 TO PASSES
002200         DISPLAY 'PASSED: ' TEST-NAME
002300     ELSE
002400         DISPLAY 'FAILED : ' TEST-NAME
002500         DISPLAY 'EXPECTED ' EXPECTED
002600         DISPLAY 'ACTUAL : ' ACTUAL
002700    
002800         ADD 1 TO FAILURES
002900     END-IF
003000 
003100     GOBACK. 
003200