//API4MAP JOB (ACCT#),'DENIS',MSGLEVEL=(1,1),
//         NOTIFY=&SYSUID,CLASS=A,MSGCLASS=H,TIME=(0,15),COND=(4,LT)
//         JCLLIB  ORDER=SDJ.FORM.PROCLIB
//********
//COMPCIC  EXEC COMPCICS,NOMPGM=A5PART
//STEPCIC.SYSIN    DD DSN=&SYSUID..SOURCE.COBOL(&NOMPGM),DISP=SHR
//STEPCOB.SYSLIB   DD
//                 DD
//                 DD DSN=&SYSUID..SOURCE.COPY,DISP=SHR
