       MS5PART  DFHMSD TYPE=&SYSPARM,                                         X00010000
               MODE=INOUT,                                             X00020000
               CTRL=FREEKB,                                            X00030000
               LANG=COBOL,                                             X00040000
               TIOAPFX=YES,                                            X00050000
               DSATTS=COLOR,                                           X00060000
               MAPATTS=COLOR,                                          X00070000
               STORAGE=AUTO                                             00080000
*********************************************************************** 00090000
MAP5PAR  DFHMDI SIZE=(24,80),LINE=1,COLUMN=1                            00100000
*********************************************************************** 00110000
         DFHMDF POS=(1,1),                                             X00110100
               LENGTH=79,                                              X00110200
               INITIAL='***********************************************X00110300
               ********************************',                      X00110400
               ATTRB=(ASKIP,PROT)                                       00110500
         DFHMDF POS=(2,1),                                             X00110600
               LENGTH=2,                                               X00110700
               INITIAL='* ',                                           X00110800
               ATTRB=(ASKIP,PROT)                                       00110900
         DFHMDF POS=(2,3),                                             X00111000
               LENGTH=08,                                              X00111100
               INITIAL=' DATE : ',                                     X00111200
               ATTRB=(ASKIP,PROT),COLOR=YELLOW                          00111300
*********************************************************************** 00111400
** DATE                                                                 00111500
*********************************************************************** 00111600
DATEJ    DFHMDF POS=(2,14),                                            X00111700
               LENGTH=10,                                              X00111800
               INITIAL=' ',                                            X00111900
               ATTRB=(ASKIP,PROT,FSET)                                  00112000
         DFHMDF POS=(2,24),                                            X00112100
               LENGTH=06,                                              X00112200
               INITIAL='PGM : ',COLOR=RED,                             X00112300
               ATTRB=(ASKIP,PROT)                                       00112400
*********************************************************************** 00112500
** PGMNAME                                                              00112600
*********************************************************************** 00112700
PGMNAME  DFHMDF POS=(2,30),                                            X00112800
               LENGTH=09,                                              X00112900
               INITIAL=' ',COLOR=RED,                                  X00113000
               ATTRB=(ASKIP,PROT,FSET)                                  00113100
         DFHMDF POS=(2,39),                                            X00113200
               LENGTH=07,                                              X00113300
               INITIAL='TRANS: ',COLOR=RED,                            X00113400
               ATTRB=(ASKIP,PROT)                                       00113500
*********************************************************************** 00113600
** TRNNAME                                                              00113700
*********************************************************************** 00113800
TRNNAME  DFHMDF POS=(2,46),                                            X00113900
               LENGTH=07,                                              X00114000
               INITIAL=' ',COLOR=RED,                                  X00114100
               ATTRB=(ASKIP,PROT,FSET)                                  00114200
         DFHMDF POS=(2,53),                                            X00114300
               LENGTH=08,                                              X00114400
               INITIAL='HEURE : ',                                     X00114500
               ATTRB=(ASKIP,PROT),COLOR=YELLOW                          00114600
*********************************************************************** 00114700
** HEURE                                                                00114800
*********************************************************************** 00114900
HEURE    DFHMDF POS=(2,62),                                            X00115000
               LENGTH=08,                                              X00115100
               INITIAL=' ',                                            X00115200
               ATTRB=(ASKIP,PROT,FSET)                                  00115300
         DFHMDF POS=(2,79),                                            X00115400
               LENGTH=1,INITIAL='*',                                   X00115500
               ATTRB=(ASKIP,PROT)                                       00115600
         DFHMDF POS=(3,1),                                             X00115700
               LENGTH=79,                                              X00115800
               INITIAL='***********************************************X00115900
               ********************************',                      X00116000
               ATTRB=(ASKIP,PROT)                                       00117000
*********************************************************************** 00117100
** INSTRUCTIONS                                                         00117200
*********************************************************************** 00117300
         DFHMDF POS=(05,01),                                           X00117400
               LENGTH=30,                                              X00117500
               ATTRB=PROT,                                             X00117600
               COLOR=NEUTRAL,                                          X00117700
               INITIAL='      CALCUL ARITHMETIQUE    '                  00117800
         DFHMDF POS=(07,01),                                           X00117900
               LENGTH=43,                                              X00118000
               ATTRB=PROT,                                             X00118100
               COLOR=NEUTRAL,                                          X00118200
               INITIAL='TAPER NOMBRE 1 ET NOMBRE 2 PUIS ENTER.     '    00118300
*********************************************************************** 00118400
** NUMBER 1                                                             00118500
*********************************************************************** 00118600
         DFHMDF POS=(09,01),                                           X00118700
               LENGTH=19,                                              X00118800
               ATTRB=PROT,                                             X00118900
               COLOR=GREEN,                                            X00119000
               INITIAL='NOMBRE 1 ..............'                        00119100
NUM1     DFHMDF POS=(09,21),                                           X00119200
               LENGTH=9,                                               X00119300
               ATTRB=(UNPROT,NUM,IC),                                  X00119400
               PICIN='9(9)',                                           X00119500
               PICOUT='Z(9)',                                          X00119600
               COLOR=TURQUOISE                                          00119700
         DFHMDF POS=(09,31),                                           X00119800
               LENGTH=1,                                               X00119900
               ATTRB=ASKIP                                              00120000
*********************************************************************** 00120100
** NUMBER 2                                                             00120200
*********************************************************************** 00120300
         DFHMDF POS=(11,01),                                           X00120400
               LENGTH=19,                                              X00120500
               ATTRB=PROT,                                             X00120600
               COLOR=GREEN,                                            X00120700
               INITIAL='NOMBRE 2 ..............'                        00120800
NUM2     DFHMDF POS=(11,21),                                           X00120900
               LENGTH=9,                                               X00121000
               ATTRB=(UNPROT,NUM),                                     X00121100
               PICIN='9(9)',                                           X00121200
               PICOUT='Z(9)',                                          X00121300
               COLOR=TURQUOISE                                          00121400
         DFHMDF POS=(11,31),                                           X00121500
               LENGTH=1,                                               X00121600
               ATTRB=ASKIP                                              00121700
*********************************************************************** 00121800
** OPERATOR                                                             00121900
*********************************************************************** 00122000
         DFHMDF POS=(13,01),                                           X00122100
               LENGTH=19,                                              X00122200
               ATTRB=PROT,                                             X00122300
               COLOR=GREEN,                                            X00122400
               INITIAL='OPERATION TYPE ........'                        00122500
TYPEOP   DFHMDF POS=(13,21),                                           X00122600
               LENGTH=1,                                               X00122700
               ATTRB=UNPROT,                                           X00122800
               PICIN='X',                                              X00122900
               PICOUT='X',                                             X00123000
               COLOR=TURQUOISE                                          00123100
*********************************************************************** 00123200
         DFHMDF POS=(17,1),                                            X00123300
               LENGTH=79,                                              X00123400
               INITIAL='***********************************************X00123500
               ********************************',                      X00123600
               ATTRB=(ASKIP,PROT)                                       00123700
         DFHMDF POS=(18,1),                                            X00123800
               LENGTH=78,                                              X00123900
               INITIAL='* ESC : FIN  ENTER : CALCUL F3 : RES (MESSAGE) X00124000
               F5 : RAZ   F4 : RES (AUTRE MAP)',                       X00125000
               ATTRB=(ASKIP,PROT)                                       00126000
         DFHMDF POS=(18,79),                                           X00127000
               LENGTH=1,                                               X00128000
               INITIAL='*',                                            X00129000
               ATTRB=(ASKIP,PROT)                                       00130000
         DFHMDF POS=(19,1),                                            X00140000
               LENGTH=12,                                              X00150000
               INITIAL='* MESSAGE : ',                                 X00160000
               ATTRB=(ASKIP,PROT)                                       00170000
*********************************************************************** 00180000
** MESS1                                                                00190000
*********************************************************************** 00200000
MESS1    DFHMDF POS=(19,14),                                           X00210000
               LENGTH=55,                                              X00220000
               ATTRB=(ASKIP,PROT,BRT)                                   00230000
         DFHMDF POS=(19,79),                                           X00240000
               LENGTH=1,                                               X00250000
               INITIAL='*',                                            X00260000
               ATTRB=(ASKIP,PROT)                                       00270000
         DFHMDF POS=(20,1),                                            X00280000
               LENGTH=1,                                               X00290000
               INITIAL='*',                                            X00300000
               ATTRB=(ASKIP,PROT)                                       00310000
*********************************************************************** 00320000
** MESS2                                                                00330000
*********************************************************************** 00340000
MESS2    DFHMDF POS=(20,14),                                           X00350000
               LENGTH=56,                                              X00360000
               ATTRB=(ASKIP,PROT,BRT)                                   00370000
         DFHMDF POS=(20,79),                                           X00380000
               LENGTH=1,                                               X00390000
               INITIAL='*',                                            X00400000
               ATTRB=(ASKIP,PROT)                                       00410000
*********************************************************************** 00420000
** SEPARATEUR + FIN                                                     00430000
*********************************************************************** 00440000
         DFHMDF POS=(21,1),                                            X00450000
               LENGTH=79,                                              X00460000
               INITIAL='***********************************************X00470000
               ********************************',                      X00480000
               ATTRB=(ASKIP,PROT)                                       00490000
         DFHMSD TYPE=FINAL                                              00500000
         END                                                            00510000
         