000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ASSEQ.
000210
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000410
000500 LINKAGE SECTION.
000600 COPY TESTCONT.
000700 01 TEST-NAME PIC X(30).
000800 01 EXPECTED  PIC X(40).
000900 01 ACTUAL    PIC X(40).
000910
001000 PROCEDURE DIVISION USING TEST-CONTEXT
001100                         TEST-NAME
001200                         EXPECTED ACTUAL.
001300     ADD 1 TO TESTS-RUN
001310
001400     IF ACTUAL = EXPECTED THEN
001500         ADD 1 TO PASSES
001600     ELSE
001700         DISPLAY 'FAILED : ' TEST-NAME
001800         DISPLAY 'EXPECTED ' EXPECTED
001900         DISPLAY 'ACTUAL : ' ACTUAL
002000         ADD 1 TO FAILURES
002100     END-IF
002110
002200     GOBACK.
