000100* COPYBOOK TESTCONT - CONTEXTE DES TESTS
000200 01 TEST-CONTEXT.
000300    05 TESTS-RUN         PIC 9(3) VALUE ZERO.
000400    05 PASSES            PIC 9(3) VALUE ZERO.
000500    05 FAILURES          PIC 9(3) VALUE ZERO.