000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. DATEFMT.
000300
000400********************************************************
000500 ENVIRONMENT DIVISION.
000600
000700********************************************************
000800 DATA DIVISION.
000900 WORKING-STORAGE SECTION.
001000
001100 LINKAGE SECTION.
001200 77 LS-DATE-FORMATEE PIC X(10).
001300
001400********************************************************
001500 PROCEDURE DIVISION USING LS-DATE-FORMATEE.
001600
001700* Retourne une date simple en format string
001800     MOVE '08/08/2025' TO LS-DATE-FORMATEE.
001900
002000     GOBACK.