000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    FACTURE.
000300
000400********************************************************
000500 ENVIRONMENT DIVISION.
000600 CONFIGURATION SECTION.
000700 SPECIAL-NAMES.
000800     DECIMAL-POINT IS COMMA.
000900
001000********************************************************
001100 DATA DIVISION.
001200 WORKING-STORAGE SECTION.
001300 77 WS-NUM-FACTURE    PIC 9(6)    VALUE 123456.
001400 77 WS-MONTANT        PIC 9(5)V99 VALUE 1250,75.
001500 77 WS-CLIENT         PIC X(20)   VALUE 'DUPONT JEAN'.
001510*77 WS-DATE-IN        PIC X(8)    VALUE SPACES.
001520*77 WS-DATE-IN        PIC X(8)    VALUE '20250831'.
001530 77 WS-DATE-IN        PIC X(8)    VALUE '20250901'.
001600 77 WS-DATE-FORMATEE  PIC X(30).
001700
001800********************************************************
001900 PROCEDURE DIVISION.
002000     DISPLAY '*** DEBUT PROGRAMME FACTURE ***'.
002100     DISPLAY 'Numero facture : ' WS-NUM-FACTURE.
002200     DISPLAY 'Client         : ' WS-CLIENT.
002300     DISPLAY 'Montant        : ' WS-MONTANT.
002310
002500     PERFORM OBTENIR-DATE.
002600     DISPLAY 'Date facture   : ' WS-DATE-FORMATEE.
002700
002800     DISPLAY '*** FIN PROGRAMME FACTURE ***'.
002900     GOBACK.
003000
003100 OBTENIR-DATE.
003200     CALL 'DATEFMT' USING BY REFERENCE WS-DATE-IN
003300                          BY REFERENCE WS-DATE-FORMATEE.
