 IDENTIFICATION DIVISION.
 PROGRAM-ID.   DEMO03.

 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
 SPECIAL-NAMES.
     DECIMAL-POINT IS COMMA.

 DATA DIVISION.
 WORKING-STORAGE SECTION.

     EXEC SQL
         INCLUDE SQLCA
     END-EXEC
     EXEC SQL
         INCLUDE PROD
     END-EXEC

 77 WS-ANO   PIC 99 VALUE ZERO.

 PROCEDURE DIVISION.

      EXEC SQL
          INSERT INTO PRODUCTS(P_NO, DESCRIPTION, PRICE)
          VALUES ('P89', 'ECRAN', 19.99)
      END-EXEC

      EVALUATE SQLCODE
          WHEN -803
              DISPLAY "DOUBLON SUR LA CLE P99"
          WHEN ZERO
              DISPLAY "INSERT OK"
          WHEN OTHER
              IF SQLCODE > 0 THEN
                  DISPLAY "INSERT : WARNING ", SQLCODE
                  EXEC SQL ROLLBACK  END-EXEC
                  PERFORM TEST-SQLCODE
              ELSE
                 PERFORM ABEND-PROG
              END-IF
      END-EVALUATE


      EXEC SQL
          UPDATE PRODUCTS
          SET DESCRIPTION = 'IPAD !!'
          WHERE P_NO = 'P89'
      END-EXEC

      EVALUATE SQLCODE
          WHEN +100
               DISPLAY "P89 EST INEXISTANT"
           WHEN ZERO
               DISPLAY "MODIF OK"
           WHEN OTHER
               IF SQLCODE > 0 THEN
                   DISPLAY "SUPP : WARNING ", SQLCODE
                   EXEC SQL ROLLBACK  END-EXEC
                   PERFORM TEST-SQLCODE
               ELSE
                  PERFORM ABEND-PROG
               END-IF
       END-EVALUATE

 *     EXEC SQL ROLLBACK  END-EXEC
 *     PERFORM TEST-SQLCODE

       GOBACK.
  TEST-SQLCODE.

      EVALUATE TRUE
          WHEN SQLCODE = ZERO
                  CONTINUE
          WHEN SQLCODE > 0
              IF SQLCODE = +100
                  DISPLAY "JEU DE DONNEES VIDE OU FINI"
              ELSE
                  DISPLAY "WARNING : ", SQLCODE
              END-IF
          WHEN SQLCODE < ZERO
              PERFORM ABEND-PROG
      END-EVALUATE.

  ABEND-PROG.
     DISPLAY "ANOMALIE GRAVE : ", SQLCODE
     COMPUTE WS-ANO = 1 / WS-ANO.


