000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ASSEQDT.
000300
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600
000700 LINKAGE SECTION.
000800 COPY TESTCONT.
000900 01 TEST-NAME PIC X(30).
001000 01 EXPECTED PIC X(40).
001100 01 ACTUAL PIC X(40).
001200
001300 PROCEDURE DIVISION USING TEST-CONTEXT
001400                          TEST-NAME
001500                          EXPECTED ACTUAL.
001600
001700     ADD 1 TO TESTS-RUN
001800
001900     IF ACTUAL = EXPECTED THEN
002000         ADD 1 TO PASSES
002100     ELSE
002200         DISPLAY 'FAILED : ' TEST-NAME
002300         DISPLAY 'EXPECTED: [' EXPECTED ']'
002400         DISPLAY 'ACTUAL  : [' ACTUAL ']'
002500         ADD 1 TO FAILURES
002600     END-IF
002700
002800     GOBACK.