000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. DESCTEST.
000300
000400 DATA DIVISION.
001000 WORKING-STORAGE SECTION.
001100
001200 01  INPUT-DESC        PIC X(20).
001500 01  RESULT-DESC       PIC X(20).
001600 01  EXPECTED-RESULT   PIC X(20).
001700
001800 01  LIB PIC X(30).
001900 01  L-SEP PIC X(30) VALUE ALL '*'.
002000
002100 LINKAGE SECTION.
002200 COPY TESTCONT.
002300
002400 PROCEDURE DIVISION USING TEST-CONTEXT.
002500
002600     PERFORM MAJUSCULES-TEST
002700     DISPLAY 'RUN:'  TESTS-RUN  ' OK:'  PASSES  ' KO:'  FAILURES
002800     DISPLAY L-SEP
002900
003000     PERFORM MINUSCULES-TEST
003100     DISPLAY 'RUN:'  TESTS-RUN  ' OK:'  PASSES  ' KO:'  FAILURES
003200     DISPLAY L-SEP
003300
003400     PERFORM MIXTE-TEST
003500     DISPLAY 'RUN:'  TESTS-RUN  ' OK:'  PASSES  ' KO:'  FAILURES
003600     DISPLAY L-SEP
003700
003800     PERFORM MOTS-MULTIPLES-TEST
003900     DISPLAY 'RUN:'  TESTS-RUN  ' OK:'  PASSES  ' KO:'  FAILURES
004000     DISPLAY L-SEP
004100
004200     PERFORM ESPACES-MULTIPLES-TEST
004300     DISPLAY 'RUN:'  TESTS-RUN  ' OK:'  PASSES  ' KO:'  FAILURES
004400     DISPLAY L-SEP
004500
004600     PERFORM VIDE-TEST
004700     DISPLAY 'RUN:'  TESTS-RUN  ' OK:'  PASSES  ' KO:'  FAILURES
004800     DISPLAY L-SEP
004900
005000     GOBACK.
005100
005200 APPELS.
005300     CALL 'FMTDESC' USING BY CONTENT INPUT-DESC
005400                              BY REFERENCE RESULT-DESC
005500
005600     DISPLAY '******** ' LIB '*********'
005700     DISPLAY 'INPUT  : [' INPUT-DESC ']'
005800     DISPLAY 'OUTPUT : [' RESULT-DESC ']'
005900     CALL 'ASSEQTXT' USING BY REFERENCE TEST-CONTEXT
006000                           BY CONTENT LIB
006100                           BY CONTENT EXPECTED-RESULT
006200                           BY CONTENT RESULT-DESC.
006300
006400 MAJUSCULES-TEST.
006500     MOVE SPACES TO RESULT-DESC
006600     MOVE 'PRODUIT' TO INPUT-DESC
006700     MOVE 'Produit           ' TO EXPECTED-RESULT
006800     MOVE 'MAJUSCULES-TEST' TO LIB
006900     PERFORM APPELS.
007000
007100 MINUSCULES-TEST.
007200     MOVE SPACES TO RESULT-DESC
007300     MOVE 'produit' TO INPUT-DESC
007400     MOVE 'Produit           ' TO EXPECTED-RESULT
007500     MOVE 'MINUSCULES-TEST' TO LIB
007600     PERFORM APPELS.
007700
007800 MIXTE-TEST.
007900     MOVE SPACES TO RESULT-DESC
008000     MOVE 'pRoDuIt' TO INPUT-DESC
008100     MOVE 'Produit           ' TO EXPECTED-RESULT
008200     MOVE 'MIXTE-TEST' TO LIB
008300     PERFORM APPELS.
008400
008500 MOTS-MULTIPLES-TEST.
008600     MOVE SPACES TO RESULT-DESC
008700     MOVE 'produit ALIMENTAIRE' TO INPUT-DESC
008800     MOVE 'Produit Alimentaire' TO EXPECTED-RESULT
008900     MOVE 'MOTS-MULTIPLES-TEST' TO LIB
009000     PERFORM APPELS.
009100
009200 ESPACES-MULTIPLES-TEST.
009300     MOVE SPACES TO RESULT-DESC
009400     MOVE 'mot  avec  espaces' TO INPUT-DESC
009500     MOVE 'Mot  Avec  Espaces ' TO EXPECTED-RESULT
009600     MOVE 'ESPACES-MULTIPLES-TEST' TO LIB
009700     PERFORM APPELS.
009800
009900 VIDE-TEST.
010000     MOVE SPACES TO RESULT-DESC
010100     MOVE SPACES TO INPUT-DESC
010200     MOVE SPACES TO EXPECTED-RESULT
010300     MOVE 'VIDE-TEST' TO LIB
010400     PERFORM APPELS.