000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. FMTDESC.
000210
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500
000600* Variables pour le formatage de la description
000700 77 WS-MAJUSCULES  PIC X(26) VALUE "ABCDEFGHIJKLMNOPQRSTUVWXYZ".
000800 77 WS-MINUSCULES  PIC X(26) VALUE "abcdefghijklmnopqrstuvwxyz".
000900 77 WS-IDX         PIC 99 VALUE 0.
001000 77 WS-POS         PIC 99 VALUE 0.
001100 77 WS-PREV-CHAR   PIC X VALUE SPACE.
001200 77 WS-CHAR        PIC X.
001210
001300 LINKAGE SECTION.
001400 01 INPUT-DESC     PIC X(20).
001500 01 OUTPUT-DESC    PIC X(20).
001600
001700 PROCEDURE DIVISION USING INPUT-DESC, OUTPUT-DESC.
001800
001900     MOVE INPUT-DESC TO OUTPUT-DESC
002000     MOVE SPACE TO WS-PREV-CHAR
002100
002200     PERFORM VARYING WS-IDX FROM 1 BY 1
002300         UNTIL WS-IDX > FUNCTION LENGTH(OUTPUT-DESC)
002400
002500         MOVE OUTPUT-DESC(WS-IDX:1) TO WS-CHAR
002600
002700*       *--- Tout passer en minuscules ---
002800         PERFORM VARYING WS-POS FROM 1 BY 1
002900             UNTIL WS-POS > 26 OR WS-CHAR
003000                                      = WS-MAJUSCULES(WS-POS:1)
003100         END-PERFORM
003200
003300         IF WS-POS <= 26 THEN
003400             MOVE WS-MINUSCULES(WS-POS:1) TO WS-CHAR
003500         END-IF
003600
003700*       *--- Majuscule si début de mot ---
003800         IF WS-PREV-CHAR = SPACE
003900             PERFORM VARYING WS-POS FROM 1 BY 1
004000                 UNTIL WS-POS > 26 OR WS-CHAR
004100                                      = WS-MINUSCULES(WS-POS:1)
004200             END-PERFORM
004300
004400             IF WS-POS <= 26 THEN
004500                 MOVE WS-MAJUSCULES(WS-POS:1) TO WS-CHAR
004600             END-IF
004700         END-IF
004800
004900         MOVE WS-CHAR TO OUTPUT-DESC(WS-IDX:1)
005000         MOVE WS-CHAR TO WS-PREV-CHAR
005100     END-PERFORM
005200
005300     GOBACK.