//API6DESC JOB (ACCT#),'SYLVAIN',MSGCLASS=H,REGION=4M,
//         CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID,COND=(8,LT)
//***********************************************************
//*  TESTS UNITAIRES - FONCTION FORMATAGE DESCRIPTION       *
//***********************************************************
//         SET SYSUID=API6
//*
//*--- COMPILATION ASSEQTXT ----------------------------------
//*
//COMPILAS EXEC IGYWCL,PARM.COBOL=(NODYNAM,ADV,OBJECT,LIB,TEST,APOST)
//COBOL.SYSIN  DD DSN=&SYSUID..SOURCE.COBOL(ASSEQTXT),DISP=SHR
//COBOL.SYSLIB DD DSN=CEE.SCEESAMP,DISP=SHR
//             DD DSN=&SYSUID..SOURCE.COPY,DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..COBOL.LOAD,DISP=(SHR,KEEP,KEEP)
//LKED.SYSIN   DD *
 NAME ASSEQTXT(R)
/*
//*
//*--- COMPILATION FMTDESC --------------------------------
//*
//COMPFORM EXEC IGYWCL,PARM.COBOL=(NODYNAM,ADV,OBJECT,LIB,TEST,APOST)
//COBOL.SYSIN  DD DSN=&SYSUID..SOURCE.COBOL(FMTDESC),DISP=SHR
//COBOL.SYSLIB DD DSN=CEE.SCEESAMP,DISP=SHR
//             DD DSN=&SYSUID..SOURCE.COPY,DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..COBOL.LOAD,DISP=(SHR,KEEP,KEEP)
//LKED.SYSIN DD *
 NAME FMTDESC(R)
/*
//*
//*--- COMPILATION DESCTEST -----------------------------------
//*
//COMPTEST EXEC IGYWCL,PARM.COBOL=(ADV,OBJECT,LIB,TEST,APOST)
//COBOL.SYSIN  DD DSN=&SYSUID..SOURCE.COBOL(DESCTEST),DISP=SHR
//COBOL.SYSLIB DD DSN=CEE.SCEESAMP,DISP=SHR
//             DD DSN=&SYSUID..SOURCE.COPY,DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..COBOL.LOAD,DISP=(SHR,KEEP,KEEP)
//LKED.SYSLIB  DD DSN=&SYSUID..COBOL.LOAD,DISP=SHR
//LKED.SYSIN   DD *
 INCLUDE SYSLIB(ASSEQTXT)
 INCLUDE SYSLIB(FMTDESC)
 NAME DESCTEST(R)
/*
//*
//*--- EXECUTION DES TESTS ------------------------------------
//*
//STEPRUN  EXEC PGM=DESCTEST
//STEPLIB  DD DSN=&SYSUID..COBOL.LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=*
