IDENTIFICATION DIVISION.
       PROGRAM-ID. LOWERCASE-FILE.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT FICHIER-IN  ASSIGN TO 'INPUT.DAT'
               ORGANIZATION IS SEQUENTIAL.
           SELECT FICHIER-OUT ASSIGN TO 'OUTPUT.DAT'
               ORGANIZATION IS SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD FICHIER-IN.
       01 REC-IN  PIC X(80).

       FD FICHIER-OUT.
       01 REC-OUT PIC X(80).

       WORKING-STORAGE SECTION.
       01 EOF-FLAG PIC X VALUE 'N'.

       PROCEDURE DIVISION.
       MAIN-PARA.
           OPEN INPUT FICHIER-IN
                OUTPUT FICHIER-OUT
           PERFORM UNTIL EOF-FLAG = 'Y'
               READ FICHIER-IN
                   AT END MOVE 'Y' TO EOF-FLAG
               NOT AT END
                   MOVE FUNCTION LOWER-CASE(REC-IN) TO REC-OUT
                   WRITE REC-OUT
               END-READ
           END-PERFORM
           CLOSE FICHIER-IN FICHIER-OUT
           STOP RUN.
