       IDENTIFICATION DIVISION.
       PROGRAM-ID. PARSECSV.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT FICHIER-IN ASSIGN TO 'MON.USER.CSVFILE'
               ORGANIZATION IS SEQUENTIAL
               FILE STATUS IS WS-FS-IN.

       DATA DIVISION.
       FILE SECTION.
       FD  FICHIER-IN
           RECORD CONTAINS 80 CHARACTERS
           BLOCK CONTAINS 0 RECORDS
           RECORDING MODE IS F
           DATA RECORD IS REC-IN.
       01  REC-IN        PIC X(80).

       WORKING-STORAGE SECTION.
       77  WS-FS-IN      PIC XX  VALUE SPACES.
       77  POS           PIC 9(03) VALUE 1.
       77  FIELD-NB      PIC 9(02) VALUE 1.
       01  EOF-FLAG      PIC X(03) VALUE 'NON'.

       * Variables pour stocker les champs extraits
       01  WS-ID         PIC X(10).
       01  WS-NOM        PIC X(20).
       01  WS-VILLE      PIC X(30).

       01  TEMP-FIELD    PIC X(80).
       77  OUT-POS       PIC 9(03) VALUE 1.

       PROCEDURE DIVISION.
       MAIN-LOGIC.
           OPEN INPUT FICHIER-IN

           PERFORM UNTIL EOF-FLAG = 'OUI'
               READ FICHIER-IN
                   AT END MOVE 'OUI' TO EOF-FLAG
               NOT AT END
                   MOVE SPACES TO TEMP-FIELD
                   MOVE 1 TO OUT-POS
                   MOVE 1 TO FIELD-NB

                   PERFORM VARYING POS FROM 1 BY 1
                       UNTIL POS > LENGTH OF REC-IN
                       IF REC-IN(POS:1) = ';'
                           PERFORM STORE-FIELD
                           MOVE 1 TO OUT-POS
                           ADD 1 TO FIELD-NB
                           MOVE SPACES TO TEMP-FIELD
                       ELSE
                           MOVE REC-IN(POS:1)
                             TO TEMP-FIELD(OUT-POS:1)
                           ADD 1 TO OUT-POS
                       END-IF
                   END-PERFORM

                   * Dernier champ (après le dernier ;)
                   PERFORM STORE-FIELD

                   DISPLAY 'ID    = ' WS-ID
                   DISPLAY 'NOM   = ' WS-NOM
                   DISPLAY 'VILLE = ' WS-VILLE
                   DISPLAY '-------------------------'

               END-READ
           END-PERFORM

           CLOSE FICHIER-IN
           STOP RUN.

       STORE-FIELD.
           EVALUATE FIELD-NB
              WHEN 1 MOVE FUNCTION TRIM(TEMP-FIELD) TO WS-ID
              WHEN 2 MOVE FUNCTION TRIM(TEMP-FIELD) TO WS-NOM
              WHEN 3 MOVE FUNCTION TRIM(TEMP-FIELD) TO WS-VILLE
           END-EVALUATE.