//API6ET1  JOB (ACCT#),'SYLVAIN',CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),
//         NOTIFY=&SYSUID,REGION=4M,TIME=(,30),COND=(8,LT)
//****************************************************************
//* EXECUTION ETAPE 1 - CONSOLIDATION VENTES EU/AS
//****************************************************************
//STEP01   EXEC PGM=ETAPE1
//STEPLIB  DD DSN=API6.COBOL.LOAD,DISP=SHR
//VENTESEU DD DSN=API6.PROJET.VENTESEU.DATA,DISP=SHR
//VENTESAS DD DSN=API6.PROJET.VENTESAS.DATA,DISP=SHR
//SYSOUT   DD SYSOUT=*