000100*API8.SOURCE.COBOL(ASSEQ)
000200 IDENTIFICATION DIVISION.
000300 PROGRAM-ID. ASSEQ.
000400 
000500 DATA DIVISION.
000600 WORKING-STORAGE SECTION.
000700 
000800 LINKAGE SECTION.
000900 COPY TESTCONT.
001000 01 TEST-NAME PIC X(30).
001100 01 EXPECTED PIC S9(3)V99.
001200 01 ACTUAL PIC S9(3)V99.
001300
001400 PROCEDURE DIVISION USING TEST-CONTEXT
001500                          TEST-NAME
001600                          EXPECTED ACTUAL.
001700
001800     ADD 1 TO TESTS-RUN
001900    
002000     IF ACTUAL = EXPECTED THEN
002100         ADD 1 TO PASSES
002200     ELSE
002300         DISPLAY 'FAILED : ' TEST-NAME
002400         DISPLAY 'EXPECTED ' EXPECTED
002500         DISPLAY 'ACTUAL : ' ACTUAL
002600    
002700         ADD 1 TO FAILURES
002800     END-IF
002900 
003000     GOBACK. 
003100