//JESOMT   JOB (ACCT#),'SYLVAIN',MSGCLASS=H,REGION=4M,
//             CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//* ETAPE EXECUTION
//*
//JSOMT    EXEC PGM=SOMTEST
//STEPLIB  DD DSN=API8.COBOL.LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=*