000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. SOM.
000210
000300 DATA DIVISION.
000310
000400 WORKING-STORAGE SECTION.
000500 01 WS-RESULTAT PIC S9(3)V99 VALUE 0.
000510
000600 LINKAGE SECTION.
000700 01 INPUT-NUM1 PIC S9(2)V9(2).
000800 01 INPUT-NUM2 PIC S9(2)V9(2).
000900 01 RESULT PIC S9(3)V9(2).
000910
001000 PROCEDURE DIVISION USING INPUT-NUM1 INPUT-NUM2 RESULT.
001010
001100     MOVE 0 TO WS-RESULTAT
001200     COMPUTE WS-RESULTAT = INPUT-NUM1 + INPUT-NUM2
001300     ON SIZE ERROR
001400         DISPLAY "-- PBME DE TAILLE --"
001500     END-COMPUTE
001510
001600     MOVE WS-RESULTAT TO RESULT
001610
001700     GOBACK.
