000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. SOMTEST.
000300
000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600 SPECIAL-NAMES.
000700     DECIMAL-POINT IS COMMA.
000800
000900 DATA DIVISION.
001000 WORKING-STORAGE SECTION.
001100
001200 01  INPUT-NUMBER1      PIC S9(2)V9(2).
001300 01  INPUT-NUMBER2      PIC S9(2)V9(2).
001400
001500 01  RESULT            PIC S9(3)V9(2).
001600 01  EXPECTED-RESULT   PIC S9(3)V9(2).
001700
001800 01  LIB PIC X(30).
001900 01  L-SEP PIC X(30) VALUE ALL '*'.
002000
002100 LINKAGE SECTION.
002200 COPY TESTCONT.
002300
002400 PROCEDURE DIVISION USING TEST-CONTEXT.
002500
002600     PERFORM SOM-OF-TWO-POS-TEST.
002700     DISPLAY 'RUN ' TESTS-RUN ' OK ' PASSES ' KO ' FAILURES
002800     DISPLAY L-SEP
002900
003000     PERFORM SOM-OF-ONE-NEG-TEST.
003100     DISPLAY 'RUN ' TESTS-RUN ' OK ' PASSES ' KO ' FAILURES
003200     DISPLAY L-SEP
003300
003400     PERFORM SOM-OF-TWO-NEG-TEST.
003500     DISPLAY 'RUN ' TESTS-RUN ' OK ' PASSES ' KO ' FAILURES
003600     DISPLAY L-SEP
003700
003800     GOBACK.
003900
004000 APPELS.
004100     CALL 'SOM' USING BY CONTENT INPUT-NUMBER1
004200                      BY CONTENT INPUT-NUMBER2
004300                      BY REFERENCE RESULT
004400
004500     DISPLAY '******** ' LIB '*********'
004600     CALL 'ASSEQ' USING BY REFERENCE TEST-CONTEXT
004700                        BY CONTENT LIB
004800                        BY CONTENT EXPECTED-RESULT
004900                        BY CONTENT RESULT.
005000
005100 SOM-OF-TWO-POS-TEST.
005200     MOVE 0 TO RESULT
005300     MOVE 5,10  TO INPUT-NUMBER1
005400     MOVE 7,35  TO INPUT-NUMBER2
005500     MOVE 12,45 TO EXPECTED-RESULT
005600     MOVE 'SOM-OF-TWO-POS-TEST' TO LIB
005700     PERFORM APPELS.
005800
005900
006000 SOM-OF-ONE-NEG-TEST.
006100     MOVE 0 TO RESULT
006200     MOVE -5,10  TO INPUT-NUMBER1
006300     MOVE 7,35  TO INPUT-NUMBER2
006400     MOVE 2,25 TO EXPECTED-RESULT
006500
006600     MOVE 'SOM-OF-ONE-NEG-TEST' TO LIB
006700     PERFORM APPELS.
006800
006900 SOM-OF-TWO-NEG-TEST.
007000      MOVE 0 TO RESULT
007100      MOVE -5,84  TO INPUT-NUMBER1
007200      MOVE -7,29  TO INPUT-NUMBER2
007300      MOVE -13,13 TO EXPECTED-RESULT
007400
007500      MOVE 'SOM-OF-TWO-NEG-TEST' TO LIB
007600      PERFORM APPELS.
007700 