 IDENTIFICATION DIVISION.
 PROGRAM-ID.   DEMO01.

* AFFICHER LES INFORMATIONS DU PRODUIT 'P03'
 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
 SPECIAL-NAMES.
     DECIMAL-POINT IS COMMA.

 DATA DIVISION.
 WORKING-STORAGE SECTION.
      EXEC SQL
          INCLUDE SQLCA
      END-EXEC

      EXEC SQL
         INCLUDE PROD
      END-EXEC
 77 WS-ANO PIC 99 VALUE ZERO.

 PROCEDURE DIVISION.

     EXEC SQL
       SELECT P_NO, DESCRIPTION, PRICE
           INTO :PROD-P-NO, :PROD-DESCRIPTION, :PROD-PRICE
       FROM PRODUCTS
       WHERE P_NO = 'P03'
     END-EXEC

     EVALUATE TRUE
         WHEN SQLCODE = ZERO
             DISPLAY "NUM   : ", PROD-P-NO
             DISPLAY "DESC  : ", PROD-DESCRIPTION
             DISPLAY "PRIX  : ", PROD-PRICE
         WHEN SQLCODE > ZERO
             IF SQLCODE = +100 THEN
                  DISPLAY "PRODUIT P03 INEXISTANT !"
             ELSE
                  DISPLAY "WARNING : ", SQLCODE
             END-IF
         WHEN OTHER
             PERFORM ABEND-PROG
     END-EVALUATE

     GOBACK.

 ABEND-PROG.
     DISPLAY "ANOMALIE GRAVE : ", SQLCODE
     COMPUTE WS-ANO = 1 / WS-ANO.
