000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. DATEFMT.
000300
000400 DATA DIVISION.
000500 LINKAGE SECTION.
000600 01  LS-DATE-INPUT        PIC X(10). *> Format DB2: YYYY-MM-DD
000700 01  LS-DATE-OUTPUT       PIC X(30). *> Format: Jour, Mois JJ, AAAA
000800
000900 01  DATE-COMPONENTS.
001000     05  YYYY             PIC 9(4).
001100     05  MM               PIC 99.
001200     05  DD               PIC 99.
001300
001400 01  DAYS-OF-WEEK.
001500     05  FILLER           PIC X(9) VALUE "LUNDI   ".
001600     05  FILLER           PIC X(9) VALUE "MARDI   ".
001700     05  FILLER           PIC X(9) VALUE "MERCREDI".
001800     05  FILLER           PIC X(9) VALUE "JEUDI   ".
001900     05  FILLER           PIC X(9) VALUE "VENDREDI".
002000     05  FILLER           PIC X(9) VALUE "SAMEDI  ".
002100     05  FILLER           PIC X(9) VALUE "DIMANCHE".
002200 01  DAY-TABLE REDEFINES DAYS-OF-WEEK.
002300     05  DAY-NAME         PIC X(9) OCCURS 7 TIMES.
002400
002500 01  MONTHS.
002600     05  FILLER           PIC X(9) VALUE "JANVIER ".
002700     05  FILLER           PIC X(9) VALUE "FÉVRIER ".
002800     05  FILLER           PIC X(9) VALUE "MARS    ".
002900     05  FILLER           PIC X(9) VALUE "AVRIL   ".
003000     05  FILLER           PIC X(9) VALUE "MAI     ".
003100     05  FILLER           PIC X(9) VALUE "JUIN    ".
003200     05  FILLER           PIC X(9) VALUE "JUILLET ".
003300     05  FILLER           PIC X(9) VALUE "AOÛT    ".
003400     05  FILLER           PIC X(9) VALUE "SEPTEMBR".
003500     05  FILLER           PIC X(9) VALUE "OCTOBRE ".
003600     05  FILLER           PIC X(9) VALUE "NOVEMBRE".
003700     05  FILLER           PIC X(9) VALUE "DÉCEMBRE".
003800 01  MONTH-TABLE REDEFINES MONTHS.
003900     05  MONTH-NAME       PIC X(9) OCCURS 12 TIMES.
004000
004100 PROCEDURE DIVISION USING LS-DATE-INPUT, LS-DATE-OUTPUT.
004200     UNSTRING LS-DATE-INPUT DELIMITED BY '-' 
004300         INTO YYYY, MM, DD
004400     END-UNSTRING
004500
004600     COMPUTE DAY-OF-WEEK = FUNCTION MOD(
004700         FUNCTION INTEGER-OF-DATE(YYYY * 10000 + MM * 100 + DD)
004800         , 7) + 1
004900
005000     STRING 
005100         DAY-NAME(DAY-OF-WEEK) ", " 
005200         MONTH-NAME(MM) " " DD ", " YYYY
005300         DELIMITED BY SIZE INTO LS-DATE-OUTPUT
005400     END-STRING
005500
005600     GOBACK.