       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAINPGM.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 DATE-FROM-SUB     PIC X(50).

       LINKAGE SECTION.
       01 WS-DATE-FORMATTED PIC X(50).

       PROCEDURE DIVISION.

           CALL 'DATEFMT' USING WS-DATE-FORMATTED
           MOVE WS-DATE-FORMATTED TO DATE-FROM-SUB

           DISPLAY 'Date du jour : ' DATE-FROM-SUB

           STOP RUN.
