000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    TP10.
000300
000400********************************************************
000500 ENVIRONMENT DIVISION.
000600 CONFIGURATION SECTION.
000700 SPECIAL-NAMES.
000800     DECIMAL-POINT IS COMMA.
000900
001000 INPUT-OUTPUT SECTION.
001100 FILE-CONTROL.
001200      SELECT F1 ASSIGN TO F1CLIENT
001300      ORGANIZATION IS SEQUENTIAL.
001400
001500      SELECT F2 ASSIGN TO F2CLIENT
001600      ORGANIZATION IS SEQUENTIAL.
001700
001800********************************************************
001900 DATA DIVISION.
002000 FILE SECTION.
002100 FD F1.
002200 01 ENR-CLI-F1.
002300    05 CLI-F1  PIC 9(4).
002400    05 MONT-F1 PIC 9(5)V99.
002500
002600 FD F2.
002700 01 ENR-CLI-F2.
002800    05 CLI-F2  PIC 9(4).
002900    05 MONT-F2 PIC 9(5)V99.
003000
003100 WORKING-STORAGE SECTION.
003200 01 WS-FF-F1 PIC 9 VALUE ZERO.
003300     88 NFF-F1 VALUE 0.
003400     88 FF-F1  VALUE 1.
003500 01 WS-FF-F2 PIC 9 VALUE ZERO.
003600     88 NFF-F2 VALUE 0.
003700     88 FF-F2  VALUE 1.
003800
003900 01 WS-CLI PIC 9(4).
004000 01 WS-CUMUL-F1 PIC 9(5)V99 VALUE ZERO.
004100 01 WS-CUMUL-F2 PIC 9(5)V99 VALUE ZERO.
004200 01 WS-CUMUL PIC 9(5)V99 VALUE ZERO.
004300
004400 01 ED-CUM-CLI PIC ZZ.ZZ9,99 VALUE ZERO.
004500
004600********************************************************
004700 PROCEDURE DIVISION.
004800
004900     OPEN INPUT F1 F2
005000     PERFORM LECT-F1
005100     PERFORM LECT-F2
005200
005300     PERFORM UNTIL FF-F1 AND FF-F2
005400        MOVE ZERO TO WS-CUMUL WS-CUMUL-F1 WS-CUMUL-F2
005500        EVALUATE TRUE
005600        WHEN CLI-F1 < CLI-F2
005700           DISPLAY 'CLIENT F1: ' CLI-F1
005800           PERFORM TRT-F1
005900        WHEN CLI-F1 > CLI-F2
006000           DISPLAY 'CLIENT F2: ' CLI-F2
006100           PERFORM TRT-F2
006200        WHEN OTHER
006300           DISPLAY 'CLIENT F1/F2: ' CLI-F1
006400           PERFORM TRT-F1
006500           PERFORM TRT-F2
006600        END-EVALUATE
006700        PERFORM AFF-INFOS
006800
006900     END-PERFORM
007000
007100     CLOSE F1 F2
007200
007300     GOBACK.
007400
007500 AFF-INFOS.
007600     COMPUTE WS-CUMUL = WS-CUMUL-F1 + WS-CUMUL-F2
007700     MOVE WS-CUMUL TO ED-CUM-CLI
007800     DISPLAY 'TOTAL : ' ED-CUM-CLI
007900     .
008000
008100 TRT-F1.
008200     MOVE CLI-F1 TO WS-CLI
008300*    MOVE ZERO TO WS-CUMUL-F1
008400     PERFORM UNTIL WS-CLI NOT = CLI-F1 OR FF-F1
008500        ADD MONT-F1 TO WS-CUMUL-F1
008600        PERFORM LECT-F1
008700     END-PERFORM.
008800
008900 TRT-F2.
009000     MOVE CLI-F2 TO WS-CLI
009100*    MOVE ZERO TO WS-CUMUL-F2
009200     PERFORM UNTIL WS-CLI NOT = CLI-F2 OR FF-F2
009300        ADD MONT-F2 TO WS-CUMUL-F2
009400        PERFORM LECT-F2
009500     END-PERFORM.
009600
009700 LECT-F1.
009800     READ F1 AT END
009900*       DISPLAY 'FIN DU FICHIER F1 !'
010000           SET FF-F1 TO TRUE
010100           MOVE 9999 TO CLI-F1
010200     END-READ.
010300
010400 LECT-F2.
010500     READ F2 AT END
010600*       DISPLAY 'FIN DU FICHIER F2 !'
010700           SET FF-F2 TO TRUE
010800           MOVE 9999 TO CLI-F2
010900     END-READ.
