000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. SMENTION.
000300
000400 ENVIRONMENT DIVISION.
000500 DATA DIVISION.
000600 WORKING-STORAGE SECTION.
000700 01 WS-NOTE PIC 9(2)V9.
000800
000900 LINKAGE SECTION.
001000* PAS FORCEMENT LES MEMES NOMS
001100* PAS DE VALUE
001200* MEME LONGUEUR
001300* POSSIBLE DE RECONSIDERER LE TYPE DES PARAMETRES
001400 77 LS-NOTE    PIC 9(2)V9.
001500 77 LS-MENTION PIC X(10).
001600
001700* ORDRE EST ICI TRES IMPORTANT (CORRESPONDANCE ENTRE LES ARGUMENTS
001800*       PASSES ET LES VARIABLES DE LA LINKAGE SECTION
001900 PROCEDURE DIVISION USING LS-NOTE LS-MENTION.
002000
002100     MOVE LS-NOTE TO WS-NOTE
002200
002300     EVALUATE TRUE
002400        WHEN WS-NOTE = ZERO
002500            MOVE 'ELIMINE(E)' TO LS-MENTION
002600        WHEN WS-NOTE > ZERO AND WS-NOTE < 8
002700            MOVE 'ECHEC' TO LS-MENTION
002800        WHEN WS-NOTE >= 8 AND < 10
002900            MOVE 'RATTRAPAGE' TO LS-MENTION
003000        WHEN WS-NOTE >= 10 AND < 12
003100            MOVE 'PASSABLE' TO LS-MENTION
003200        WHEN WS-NOTE >= 12 AND < 14
003300            MOVE 'ASSEZ BIEN' TO LS-MENTION
003400        WHEN WS-NOTE >= 14 AND < 16
003500            MOVE 'BIEN' TO LS-MENTION
003600        WHEN WS-NOTE >= 16 AND <= 20
003700            MOVE 'TRES BIEN' TO LS-MENTION
003800        WHEN OTHER
003900            MOVE 'INVALIDE !' TO LS-MENTION
004000     END-EVALUATE.
004100
004200     GOBACK.
004300
