000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    TP09.
000300
000400********************************************************
000500 ENVIRONMENT DIVISION.
000600 CONFIGURATION SECTION.
000700 SPECIAL-NAMES.
000800     DECIMAL-POINT IS COMMA.
000900
001000 INPUT-OUTPUT SECTION.
001100 FILE-CONTROL.
001200      SELECT STUD ASSIGN TO STUDENTS
001300      ORGANIZATION IS SEQUENTIAL.
001400
001500      SELECT RES  ASSIGN TO RESULTAT
001600      ORGANIZATION IS SEQUENTIAL.
001700
001800********************************************************
001900 DATA DIVISION.
002000 FILE SECTION.
002100 FD STUD.
002200 01 ENR-STUD.
002300    05 MAT-STUD  PIC X(2).
002400    05 NOM-STUD  PIC X(10).
002500    05 NOTE-STUD PIC 9(2)V9.
002600
002700 FD RES.
002800 01 ENR-RES      PIC X(40).
002900
003000 WORKING-STORAGE SECTION.
003100 77 WS-FLAG-STUD   PIC 9   VALUE ZERO.
003200    88 NFF-STUD    VALUE 0.
003300    88 FF-STUD     VALUE 1.
003400
003500 01 L-DETAIL.
003600   05 FILLER      PIC   XX   VALUE '* '.
003700   05 ED-MAT      PIC   99.
003800   05 FILLER      PIC   XXX  VALUE ' * '.
003900   05 ED-NOM      PIC   X(10).
004000   05 FILLER      PIC   XXX  VALUE ' * '.
004100   05 ED-NOTE     PIC   Z9,99.
004200   05 FILLER      PIC   XXX  VALUE ' * '.
004300   05 ED-MENTION  PIC   X(10).
004400   05 FILLER      PIC   XX   VALUE ' *'.
004500
004600 01 L-ETOILE      PIC X(40)  VALUE ALL '*'.
004700
004800********************************************************
004900 PROCEDURE DIVISION.
005000     SET NFF-STUD TO TRUE
005100     OPEN INPUT STUD
005200
005300     OPEN OUTPUT RES
005400
005500     PERFORM LECT-STUD
005600     PERFORM UNTIL FF-STUD
005700
005800          PERFORM DEF-MENTION
005900          PERFORM AFF-STUD
006000
006100          PERFORM LECT-STUD
006200
006300     END-PERFORM
006400     WRITE ENR-RES FROM L-ETOILE
006500
006600     CLOSE STUD RES
006700
006800     GOBACK.
006900
007000 DEF-MENTION.
007100     CALL 'SMENTION' USING BY CONTENT NOTE-STUD
007200                           BY REFERENCE ED-MENTION
007300     .
007400
007500 AFF-STUD.
007600     WRITE ENR-RES FROM L-ETOILE
007700     MOVE MAT-STUD   TO   ED-MAT
007800     MOVE NOM-STUD   TO   ED-NOM
007900     MOVE NOTE-STUD  TO   ED-NOTE
008000     WRITE ENR-RES FROM L-DETAIL
008100     .
008200
008300 LECT-STUD.
008400      READ STUD AT END
008500          DISPLAY 'FIN DU FICHIER STUDENTS !'
008600          SET FF-STUD TO TRUE
008700      END-READ.
008800
