 IDENTIFICATION DIVISION.
 PROGRAM-ID.   EXO02.

 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
 SPECIAL-NAMES.
     DECIMAL-POINT IS COMMA.

 DATA DIVISION.
 WORKING-STORAGE SECTION.
      
      EXEC SQL
          INCLUDE SQLCA
      END-EXEC

      EXEC SQL
         INCLUDE EMP
      END-EXEC

* DECLARATION DU CURSEUR
      EXEC SQL
         DECLARE CEMPS CURSOR
         FOR 
         SELECT E_NO, LNAME, FNAME, STREET, CITY, ST, ZIP,
                PAYRATE, COM, DEPT
         FROM EMPLOYEES
      END-EXEC
    
 77 WS-ANO   PIC 99 VALUE ZERO.   
 77 ED-PAYRATE PIC Z99,99.
 77 ED-COM     PIC 9,99.
 PROCEDURE DIVISION.
 
    EXEC SQL 
        OPEN CEMPS
    END-EXEC
    PERFORM TEST-SQLCODE
    
    PERFORM FETCH-EMP
        
    PERFORM UNTIL SQLCODE = +100
    
        DISPLAY "NUM   : ", EMP-E-NO
        DISPLAY "NOM   : ", EMP-LNAME
        DISPLAY "VILLE : ", EMP-CITY
        MOVE EMP-PAYRATE TO ED-PAYRATE
        MOVE EMP-COM     TO ED-COM
        DISPLAY "SALR  : ", EMP-PAYRATE
        DISPLAY "SALR  : ", ED-PAYRATE
        DISPLAY "COMM  : ", EMP-COM
        DISPLAY "COMM  : ", ED-COM
        DISPLAY "---------------------------------"
        
        PERFORM FETCH-EMP
        
    END-PERFORM
    
    EXEC SQL 
        CLOSE CEMPS
    END-EXEC
    PERFORM TEST-SQLCODE        
    
    GOBACK.
    
FETCH-EMP.
    EXEC SQL 
        FETCH CEMPS
        INTO :EMP-E-NO,:EMP-LNAME,:EMP-FNAME,
             :EMP-STREET,:EMP-CITY,:EMP-ST,:EMP-ZIP,
             :EMP-PAYRATE,:EMP-COM,:EMP-DEPT
    END-EXEC    
    PERFORM TEST-SQLCODE     
        
TEST-SQLCODE.
        
    EVALUATE TRUE
        WHEN SQLCODE = ZERO
                CONTINUE
        WHEN SQLCODE > 0
            IF SQLCODE = +100
                DISPLAY "JEU DE DONNEES VIDE OU FINI"
            ELSE
                DISPLAY "WARNING : ", SQLCODE
            END-IF
        WHEN SQLCODE < ZERO
            PERFORM ABEND-PROG
    END-EVALUATE.
    
ABEND-PROG.
    DISPLAY "ANOMALIE GRAVE : ", SQLCODE
    COMPUTE WS-ANO = 1 / WS-ANO.
        
        
        
        
        
        
        
        
        
        
        