 IDENTIFICATION DIVISION.
 PROGRAM-ID. EXO01.

* AFFICHER LES INFORMATIONS DE L'E
 ENVIRONMENT DIVISION.
 CONFIGURATION SECTION.
 SPECIAL-NAMES.
     DECIMAL-POINT IS COMMA.

 DATA DIVISION.
 WORKING-STORAGE SECTION.
     EXEC SQL
         INCLUDE SQLCA
     END-EXEC.

     EXEC SQL
         INCLUDE EMP
     END-EXEC.
 77 WS-ANO PIC 99 VALUE ZERO.

 77 ED-PAYRATE PIC Z99,99.
 77 ED-COM     PIC 9,99.

 77 WS-SYSIN   PIC 99.
 77 EMP-RECH   PIC S9(2)V USAGE COMP-3.

 PROCEDURE DIVISION.

     ACCEPT WS-SYSIN FROM SYSIN
     DISPLAY "SYSIN : ", WS-SYSIN
     MOVE WS-SYSIN TO EMP-E-NO
     DISPLAY "COUCOU !"
     EXEC SQL
       SELECT E_NO, LNAME, FNAME, STREET, CITY, ST, ZIP,
              PAYRATE, COM, DEPT
           INTO :EMP-E-NO,:EMP-LNAME,:EMP-FNAME,
                :EMP-STREET,:EMP-CITY,:EMP-ST,:EMP-ZIP,
                :EMP-PAYRATE,:EMP-COM,:EMP-DEPT
       FROM EMPLOYEES
       WHERE E_NO = :EMP-E-NO
     END-EXEC

     EVALUATE TRUE
         WHEN SQLCODE = ZERO
             DISPLAY "NUM   : ", EMP-E-NO
             DISPLAY "NOM   : ", EMP-LNAME
             DISPLAY "VILLE : ", EMP-CITY
             MOVE EMP-PAYRATE TO ED-PAYRATE
             MOVE EMP-COM     TO ED-COM
             DISPLAY "SALR  : ", EMP-PAYRATE
             DISPLAY "SALR  : ", ED-PAYRATE
             DISPLAY "COMM  : ", EMP-COM
             DISPLAY "COMM  : ", ED-COM
         WHEN SQLCODE > ZERO
             IF SQLCODE = +100 THEN
                  DISPLAY "EMPLOYE INEXISTANT !"
             ELSE
                  DISPLAY "WARNING : ", SQLCODE
             END-IF
         WHEN OTHER
             PERFORM ABEND-PROG
     END-EVALUATE

     GOBACK.

 ABEND-PROG.
     DISPLAY "ANOMALIE GRAVE : ", SQLCODE
     COMPUTE WS-ANO = 1 / WS-ANO.

