//API6JSUP JOB NOTIFY=&SYSUID,CLASS=A,MSGCLASS=H,
//           TIME=(0,30),MSGLEVEL=(1,1)
//*
//* SUPPRIME L'ANCIEN EXTRACT.DATA
//SUPPRIME EXEC PGM=IEFBR14
//STEPLIB  DD DSN=SYS1.LINKLIB,DISP=SHR
//FICHIER  DD DSN=API6.PROJET.EXTRACT.DATA,DISP=(OLD,DELETE)
//SYSOUT   DD SYSOUT=*
